In [ ]:
PostgreSQL: FROM + JOIN => WHERE => GROUP BY => HAVING => SELECT => DISTINCT => ORDER BY => LIMIT.

AS - "в качестве": левый операнд AS(в качестве) правого операнда, можно также перевести как "обзови всё что слева фразой справа"

CASE - нет, это не кейс, но этимология таже, чемодан так называют потому что ему подобные брали на всякий СЛУЧАЙ, в данном контексте это слово стоит понимать как "В СЛУЧАЕ"
WHEN - продолжим про случай, переводится как "КОГДА"
THEN - вот именно "ТОГДА"
ELSE - буквально переводится как "В ПРОЧЕМ" или "В ОСТАЛЬНЫХ СЛУЧАЯХ"
END - конец, амба, приехали, заканчивай съёмку

SELECT - кто не играл в Денди/Сегу? В данном случае употребляется в повелительном наклонении - приказ СУБД выбрать что-то
FROM - да-да как вы догадалсь уже наверное - "ИЗ" чего-то (или отобрать у кого-то, наше дело маленькое - сказать, а у кого СУБД отбирать будет... Проблемы индейцев шерифов не ... волнуют)
JOIN - Наслаждайся!!! Конечно первое, и в данном случае - правильное значение этого слова: присоединяйся!
`Даша` (INNER)JOIN `Петя` - сегодня они встречаются в ресторанчике как-раз на пол пути от Пети к Даше
`Даша` LEFT(INNER) JOIN `Петя` - Петя пошёл налево, но не на грядки, а - к Даше, причём в данном случае - домой к Даше.
Ну а если `Даша` RIGHT(INNER) JOIN `Петя` - то, видимо Даша не дождалась Петю и пошла к нему сама (разумеется - не налево).

`Даша` LEFT OUTER JOIN `Петя` - Петя пришёл во двор к Даше, и Даша вышла туда-же(причём - оба со всеми своими пожитками-нажитками, видимо, куда-то собрались).
`Даша` CROSS JOIN `Петя` - м-м-м... дайте ка подумать... А-а-а... Петя с Дашей переехали в другую квартиру(или дом) и наплодили много маленьких Петь и Даш всех возможных вариантов сочетания Пети с Дашей(надеюсь - не слишком пошло)
WHERE - "Где-где...? - В Караганде... которая находится в РФ" или "в гнезде в котором именно 2 яйца, а не 3-5-6", кому как нравится...

BY - не путайте с "BYE", а то - пошлёт вас СУБД в ту самую баню... Не знаю как другим, но мне большинство проблем "BY"-барабану, я - заядлый оптимист =D

ну а дальше ничего особо сложного и нет:
GROUP - в данном случае скорее глагол: СГРУППИРУЙ то, да сё...
HAVING - имеющих 3 головы AND 5 хвостов
ORDER - в каждом доме должен быть, а в голове и подавно(плохо, когда там каша-малаша)!!! ;)
PARTITION - раздел, в данном случае - не глагол!!! Существительное - "разделение", "разграничение".
UNION - это когда Иа вернули хвост... получился UNION ослика и его хвостика =)

Как же я мог забыть про оператор - OVER:
применяется к оконным фнкциям, указывая им в каких "PARTITION BY"-йнах задуманное вершить, и в каком "ORDER BY" тамошних("PARTITION BY"-йных) прихожан обслуживать...
Первым значением слова является наречие "через", в данном контексте - "вот там, по всей 'PARTITION BY'-йной местности"

LIKE - "I like to move it - move it..." Нет, это не лайк, ну, во всяком случае - не в том смысле в котором вы могли бы подумать... 'Даша' LIKE 'Петя' не значит что Даше нравится Петя, в даном случае это предлог "как" или причастие "похож", то биш,- разве что только количеством букв в имени. В языке SQL обзывается паттерном(шаблоном)
BETWEEN - один шаг BETWEEN любовь AND ненависть

PRIMARY - помните такого: Пётр PRIME? Переводится как "первичный", имеется в виду - "KEY", эта парочка слов творит магию СУБД определяя золотой ключик. Но, стоит заметить что это не единственный магический артефакт, есть ещё один - FOREIGN, тоже - ключик. Эти ключи - истинная сила RELATION-ной модели базы данных, именно они и творят чудеса слияния головы, хвоста и ног в нечто большее и прекрасное. Relation - переводится как "отношение" чего-то к чему-то, либо как "связь" чего-то с чем-то(кого-то с кем-то - тоже).

UPDATE - сокращение от "Up to date", дословно переводится как "поднято до даты(последней)", только в контексте SQL это - глагол, который говорит базе - Обнови!
SET - нет, это не про восточную кухню, это глагол - установи
INSERT - это из оперы про: запихни, впихни, воткни INTO-дато =D
DELETE - интересное слово: ДЕЛЕТЕ... Как вспомню знакомство мамы с компуктером... Слово "ДЕЛЕТЕ" - глагол "удали" в исключительно повелительном наклонении.
DROP - О-о-о-о, вот мы и добрались до самого интересного... Никогда, Вы слышыте меня? Никогда не бросайте каку!!! На время работы с БД забудьте чему вас учили родители по данному поводу в детстве... Каку можно и поднять, а вот TABLE который по идее - нечто "Таблетное", например: таблица(а может и TAB чьего-то лица, ибо "Tab" - нарицательное обозначающее некую ровную поверхность прямоугольной формы), или что ещё хуже - DATABASE, уйдут в небытие, сразу и не замедлительно!!! Это относится и к мегаинтересному слову "ДЕЛЕТЕ", с небольшой оговоркой...

In [ ]:
!pip install ipython-sql sqlalchemy psycopg2

In [3]:
import sqlalchemy

In [4]:
sqlalchemy.create_engine("postgresql://postgres:Qq123456@localhost:5432/postgres")

Engine(postgresql://postgres:***@localhost:5432/postgres)

In [8]:
%load_ext sql
%sql postgresql://postgres:Qq123456@localhost:5432/postgres
## помогло убрать ошибки
%config SqlMagic.style = '_DEPRECATED_DEFAULT'

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [9]:
%%sql

SELECT version();

 * postgresql://postgres:***@localhost:5432/postgres
1 rows affected.

[('PostgreSQL 16.3, compiled by Visual C++ build 1939, 64-bit',)]

In [17]:
%%sql
DROP SCHEMA IF EXISTS stepik CASCADE;

CREATE SCHEMA IF NOT EXISTS stepik;

 * postgresql://postgres:***@localhost:5432/postgres
Done.
Done.

[]

In [8]:
%%sql
CREATE TABLE stepik.book (
    book_id INT PRIMARY KEY GENERATED ALWAYS AS IDENTITY,
    title VARCHAR(50),
    author VARCHAR(30),
    price DECIMAL(8,2),
    amount INT                                                         
);

 * postgresql://postgres:***@localhost:5432/postgres
Done.

[]

In [10]:
%%sql
INSERT INTO stepik.book(title, author, price, amount)
VALUES 
    ('Мастер и Маргарита', 'Булгаков М.А.', 670.99, 3),
    ('Белая гвардия', 'Булгаков М.А.', 540.50, 5),
    ('Идиот', 'Достоевский Ф.М.', 460.00, 10),
    ('Братья Карамазовы', 'Достоевский Ф.М.', 799.01, 2);

 * postgresql://postgres:***@localhost:5432/postgres
4 rows affected.

[]

In [11]:
%%sql
INSERT INTO stepik.book(title, author, price, amount)
VALUES ('Стихотворения и поэмы', 'Есенин С.А.', 650.00, 15);

 * postgresql://postgres:***@localhost:5432/postgres
1 rows affected.

[]

In [14]:
%%sql
SELECT * FROM stepik.book

 * postgresql://postgres:***@localhost:5432/postgres
5 rows affected.

[(1, 'Мастер и Маргарита', 'Булгаков М.А.', Decimal('670.99'), 3),
 (2, 'Белая гвардия', 'Булгаков М.А.', Decimal('540.50'), 5),
 (3, 'Идиот', 'Достоевский Ф.М.', Decimal('460.00'), 10),
 (4, 'Братья Карамазовы', 'Достоевский Ф.М.', Decimal('799.01'), 2),
 (5, 'Стихотворения и поэмы', 'Есенин С.А.', Decimal('650.00'), 15)]

In [26]:
%%sql
SELECT author, title, price
FROM stepik.book

 * postgresql://postgres:***@localhost:5432/postgres
5 rows affected.

[('Булгаков М.А.', 'Мастер и Маргарита', Decimal('670.99')),
 ('Булгаков М.А.', 'Белая гвардия', Decimal('540.50')),
 ('Достоевский Ф.М.', 'Идиот', Decimal('460.00')),
 ('Достоевский Ф.М.', 'Братья Карамазовы', Decimal('799.01')),
 ('Есенин С.А.', 'Стихотворения и поэмы', Decimal('650.00'))]

In [27]:
%%sql
SELECT 
    title AS Название, 
    author AS Автор 
FROM stepik.book;

 * postgresql://postgres:***@localhost:5432/postgres
5 rows affected.

[('Мастер и Маргарита', 'Булгаков М.А.'),
 ('Белая гвардия', 'Булгаков М.А.'),
 ('Идиот', 'Достоевский Ф.М.'),
 ('Братья Карамазовы', 'Достоевский Ф.М.'),
 ('Стихотворения и поэмы', 'Есенин С.А.')]

In [48]:
%%sql
SELECT 
    title, amount,
    amount * 1.65 AS pack 
FROM stepik.book;

 * postgresql://postgres:***@localhost:5432/postgres
5 rows affected.

[('Мастер и Маргарита', 3, Decimal('4.95')),
 ('Белая гвардия', 5, Decimal('8.25')),
 ('Идиот', 10, Decimal('16.50')),
 ('Братья Карамазовы', 2, Decimal('3.30')),
 ('Стихотворения и поэмы', 15, Decimal('24.75'))]

In [49]:
%%sql
SELECT title, price, 
    (price * 18.0 / 100)/( 1 + 18.0 / 100) AS tax, 
    price/1.18 AS price_tax 
FROM stepik.book;

 * postgresql://postgres:***@localhost:5432/postgres
5 rows affected.

[('Мастер и Маргарита', Decimal('670.99'), Decimal('102.35440677966101694915'), Decimal('568.6355932203389831')),
 ('Белая гвардия', Decimal('540.50'), Decimal('82.44915254237288135593'), Decimal('458.0508474576271186')),
 ('Идиот', Decimal('460.00'), Decimal('70.16949152542372881356'), Decimal('389.8305084745762712')),
 ('Братья Карамазовы', Decimal('799.01'), Decimal('121.88288135593220338983'), Decimal('677.1271186440677966')),
 ('Стихотворения и поэмы', Decimal('650.00'), Decimal('99.15254237288135593220'), Decimal('550.8474576271186441'))]

In [54]:
%%sql
SELECT title, author, amount,
    ROUND(price * 0.7, 2) AS new_price
FROM stepik.book;

 * postgresql://postgres:***@localhost:5432/postgres
5 rows affected.

[('Мастер и Маргарита', 'Булгаков М.А.', 3, Decimal('469.69')),
 ('Белая гвардия', 'Булгаков М.А.', 5, Decimal('378.35')),
 ('Идиот', 'Достоевский Ф.М.', 10, Decimal('322.00')),
 ('Братья Карамазовы', 'Достоевский Ф.М.', 2, Decimal('559.31')),
 ('Стихотворения и поэмы', 'Есенин С.А.', 15, Decimal('455.00'))]

In [61]:
%%sql
SELECT title, amount, price, 
    CASE 
        WHEN amount < 4 THEN price * 0.5
        ELSE price * 0.7 END
    AS sale
FROM stepik.book;

 * postgresql://postgres:***@localhost:5432/postgres
5 rows affected.

[('Мастер и Маргарита', 3, Decimal('670.99'), Decimal('335.495')),
 ('Белая гвардия', 5, Decimal('540.50'), Decimal('378.350')),
 ('Идиот', 10, Decimal('460.00'), Decimal('322.000')),
 ('Братья Карамазовы', 2, Decimal('799.01'), Decimal('399.505')),
 ('Стихотворения и поэмы', 15, Decimal('650.00'), Decimal('455.000'))]

In [71]:
%%sql
SELECT title, amount, price,
    ROUND(
     CASE
        WHEN amount < 4 THEN price * 0.5 
        WHEN amount < 11 THEN price * 0.7 
        ELSE price * 0.9 END,
     2) AS sale,
    CASE
        WHEN amount < 4 THEN 'скидка 50%' 
        WHEN amount < 11 THEN 'скидка 30%'
        ELSE 'скидка 10%' END
        AS Ваша_скидка
FROM stepik.book;

 * postgresql://postgres:***@localhost:5432/postgres
5 rows affected.

[('Мастер и Маргарита', 3, Decimal('670.99'), Decimal('335.50'), 'скидка 50%'),
 ('Белая гвардия', 5, Decimal('540.50'), Decimal('378.35'), 'скидка 30%'),
 ('Идиот', 10, Decimal('460.00'), Decimal('322.00'), 'скидка 30%'),
 ('Братья Карамазовы', 2, Decimal('799.01'), Decimal('399.51'), 'скидка 50%'),
 ('Стихотворения и поэмы', 15, Decimal('650.00'), Decimal('585.00'), 'скидка 10%')]

In [75]:
%%sql
SELECT author, title,
    ROUND(
        CASE
            WHEN author = 'Есенин С.А.' THEN price * 1.05
            WHEN author = 'Булгаков М.А.' THEN price * 1.1
            ELSE price END,
        2) AS new_price
FROM stepik.book

 * postgresql://postgres:***@localhost:5432/postgres
5 rows affected.

[('Булгаков М.А.', 'Мастер и Маргарита', Decimal('738.09')),
 ('Булгаков М.А.', 'Белая гвардия', Decimal('594.55')),
 ('Достоевский Ф.М.', 'Идиот', Decimal('460.00')),
 ('Достоевский Ф.М.', 'Братья Карамазовы', Decimal('799.01')),
 ('Есенин С.А.', 'Стихотворения и поэмы', Decimal('682.50'))]

In [80]:
%%sql
SELECT title, price 
FROM stepik.book
WHERE price < 600;

SELECT title, author, price * amount AS total
FROM stepik.book
WHERE price * amount > 4000;

 * postgresql://postgres:***@localhost:5432/postgres
2 rows affected.
2 rows affected.

[('Идиот', 'Достоевский Ф.М.', Decimal('4600.00')),
 ('Стихотворения и поэмы', 'Есенин С.А.', Decimal('9750.00'))]

In [83]:
%%sql 
SELECT author, title, price
FROM stepik.book
WHERE amount < 10

 * postgresql://postgres:***@localhost:5432/postgres
3 rows affected.

[('Булгаков М.А.', 'Мастер и Маргарита', Decimal('670.99')),
 ('Булгаков М.А.', 'Белая гвардия', Decimal('540.50')),
 ('Достоевский Ф.М.', 'Братья Карамазовы', Decimal('799.01'))]

In [87]:
%%sql
SELECT title, author, price 
FROM stepik.book
WHERE price > 600 AND author = 'Булгаков М.А.';

 * postgresql://postgres:***@localhost:5432/postgres
1 rows affected.

[('Мастер и Маргарита', 'Булгаков М.А.', Decimal('670.99'))]

In [89]:
%%sql
SELECT title, author, price, amount
FROM stepik.book
WHERE (500 > price OR 600 < price ) AND price * amount >= 5000;

 * postgresql://postgres:***@localhost:5432/postgres
1 rows affected.

[('Стихотворения и поэмы', 'Есенин С.А.', Decimal('650.00'), 15)]

In [94]:
%%sql
SELECT title, author
FROM stepik.book
WHERE 
    price BETWEEN 540.50 AND 800 AND 
    amount IN(2,3,5,7);

 * postgresql://postgres:***@localhost:5432/postgres
3 rows affected.

[('Мастер и Маргарита', 'Булгаков М.А.'),
 ('Белая гвардия', 'Булгаков М.А.'),
 ('Братья Карамазовы', 'Достоевский Ф.М.')]

In [9]:
%%sql
SELECT author, title
FROM stepik.book
WHERE amount BETWEEN 2 AND 14
ORDER BY author DESC, title

 * postgresql://postgres:***@localhost:5432/postgres
4 rows affected.

[('Достоевский Ф.М.', 'Братья Карамазовы'),
 ('Достоевский Ф.М.', 'Идиот'),
 ('Булгаков М.А.', 'Белая гвардия'),
 ('Булгаков М.А.', 'Мастер и Маргарита')]

In [10]:
%%sql
SELECT title FROM stepik.book WHERE title LIKE 'Б%'

 * postgresql://postgres:***@localhost:5432/postgres
2 rows affected.

[('Белая гвардия',), ('Братья Карамазовы',)]

In [14]:
%%sql
SELECT title FROM stepik.book 
WHERE title LIKE '_____'

 * postgresql://postgres:***@localhost:5432/postgres
1 rows affected.

[('Идиот',)]

In [11]:
%%sql
SELECT title FROM stepik.book 
WHERE title LIKE '_____'

 * postgresql://postgres:***@localhost:5432/postgres
1 rows affected.

[('Идиот',)]

In [50]:
%%sql
SELECT title, author
FROM stepik.book
WHERE trim(title) LIKE '% %' --убрать слева/справа пробелы из строки.
    AND author LIKE '%С.%' 

ORDER BY title;

 * postgresql://postgres:***@localhost:5432/postgres
2 rows affected.

[('Капитанская дочка', 'Пушкин А.С.'),
 ('Стихотворения и поэмы', 'Есенин С.А.')]

In [28]:
%%sql 
INSERT INTO stepik.book (title, author, price, amount)
VALUES 
    ('Дети полуночи',  'Рушди Салман', 950.00, 5),
    ('Лирика', 'Гумилев Н.С.', 460.00, 10),
    ('Поэмы', 'Бехтерев С.С.', 460.00, 10),
    ('Капитанская дочка', 'Пушкин А.С.', 520.50,7 );

 * postgresql://postgres:***@localhost:5432/postgres
4 rows affected.

[]

In [30]:
%%sql 
SELECT * FROM stepik.book

 * postgresql://postgres:***@localhost:5432/postgres
10 rows affected.

[(1, 'Мастер и Маргарита', 'Булгаков М.А.', Decimal('670.99'), 3),
 (2, 'Белая гвардия', 'Булгаков М.А.', Decimal('540.50'), 5),
 (3, 'Идиот', 'Достоевский Ф.М.', Decimal('460.00'), 10),
 (4, 'Братья Карамазовы', 'Достоевский Ф.М.', Decimal('799.01'), 2),
 (5, 'Стихотворения и поэмы', 'Есенин С.А.', Decimal('650.00'), 15),
 (6, None, 'Иванов С.С.', Decimal('50.00'), 10),
 (7, 'Дети полуночи', 'Рушди Салман', Decimal('950.00'), 5),
 (8, 'Лирика', 'Гумилев Н.С.', Decimal('460.00'), 10),
 (9, 'Поэмы', 'Бехтерев С.С.', Decimal('460.00'), 10),
 (10, 'Капитанская дочка', 'Пушкин А.С.', Decimal('520.50'), 7)]

In [61]:
%%sql 

SELECT * FROM stepik.book;

 * postgresql://postgres:***@localhost:5432/postgres
10 rows affected.

[(1, 'Мастер и Маргарита', 'Булгаков М.А.', Decimal('670.99'), 3),
 (2, 'Белая гвардия', 'Булгаков М.А.', Decimal('540.50'), 5),
 (3, 'Идиот', 'Достоевский Ф.М.', Decimal('460.00'), 10),
 (4, 'Братья Карамазовы', 'Достоевский Ф.М.', Decimal('799.01'), 2),
 (5, 'Стихотворения и поэмы', 'Есенин С.А.', Decimal('650.00'), 15),
 (7, 'Дети полуночи', 'Рушди Салман', Decimal('950.00'), 5),
 (8, 'Лирика', 'Гумилев Н.С.', Decimal('460.00'), 10),
 (9, 'Поэмы', 'Бехтерев С.С.', Decimal('460.00'), 10),
 (10, 'Капитанская дочка', 'Пушкин А.С.', Decimal('520.50'), 7),
 (6, ' ', 'Иванов С.С.', Decimal('50.00'), 10)]

In [67]:
%%sql
SELECT amount
FROM stepik.book
GROUP BY amount;

 * postgresql://postgres:***@localhost:5432/postgres
6 rows affected.

[(15,), (3,), (5,), (10,), (2,), (7,)]

In [11]:
%%sql
SELECT author, sum(amount), count(amount)
FROM stepik.book
GROUP BY author;

 * postgresql://postgres:***@localhost:5432/postgres
8 rows affected.

[('Рушди Салман', 5, 1),
 ('Бехтерев С.С.', 10, 1),
 ('Есенин С.А.', 15, 1),
 ('Булгаков М.А.', 8, 2),
 ('Достоевский Ф.М.', 12, 2),
 ('Пушкин А.С.', 7, 1),
 ('Гумилев Н.С.', 10, 1),
 ('Иванов С.С.', 10, 1)]

In [14]:
%%sql
INSERT INTO stepik.book(title, author)
VALUES ('Черный человек', 'Есенин С.А.');

 * postgresql://postgres:***@localhost:5432/postgres
1 rows affected.

[]

In [24]:
%%sql
SELECT * FROM stepik.book

 * postgresql://postgres:***@localhost:5432/postgres
12 rows affected.

[(1, 'Мастер и Маргарита', 'Булгаков М.А.', Decimal('670.99'), 3),
 (2, 'Белая гвардия', 'Булгаков М.А.', Decimal('540.50'), 5),
 (3, 'Идиот', 'Достоевский Ф.М.', Decimal('460.00'), 10),
 (4, 'Братья Карамазовы', 'Достоевский Ф.М.', Decimal('799.01'), 2),
 (5, 'Стихотворения и поэмы', 'Есенин С.А.', Decimal('650.00'), 15),
 (7, 'Дети полуночи', 'Рушди Салман', Decimal('950.00'), 5),
 (8, 'Лирика', 'Гумилев Н.С.', Decimal('460.00'), 10),
 (9, 'Поэмы', 'Бехтерев С.С.', Decimal('460.00'), 10),
 (10, 'Капитанская дочка', 'Пушкин А.С.', Decimal('520.50'), 7),
 (6, ' ', 'Иванов С.С.', Decimal('50.00'), 10),
 (11, 'Игрок', 'Достоевский Ф.М.', Decimal('480.50'), 10),
 (12, 'Черный человек', 'Есенин С.А.', None, None)]

In [23]:
%%sql 
UPDATE stepik.book
SET price = Null, amount = Null
WHERE title = 'Черный человек';

 * postgresql://postgres:***@localhost:5432/postgres
1 rows affected.

[]

In [28]:
%%sql
SELECT 
    author AS Автор,
    COUNT(amount) AS Различных_книг,
    SUM(amount) AS Количество_экземпляров
FROM stepik.book
GROUP BY author

 * postgresql://postgres:***@localhost:5432/postgres
8 rows affected.

[('Рушди Салман', 1, 5),
 ('Бехтерев С.С.', 1, 10),
 ('Есенин С.А.', 1, 15),
 ('Булгаков М.А.', 2, 8),
 ('Достоевский Ф.М.', 3, 22),
 ('Пушкин А.С.', 1, 7),
 ('Гумилев Н.С.', 1, 10),
 ('Иванов С.С.', 1, 10)]

In [30]:
%%sql 
SELECT author,
    MIN(price) AS Минимальная_цена,
    MAX(price) AS Максимальная_цена,
    AVG(price) AS Средняя_цена
FROM stepik.book
GROUP BY author;

 * postgresql://postgres:***@localhost:5432/postgres
8 rows affected.

[('Рушди Салман', Decimal('950.00'), Decimal('950.00'), Decimal('950.0000000000000000')),
 ('Бехтерев С.С.', Decimal('460.00'), Decimal('460.00'), Decimal('460.0000000000000000')),
 ('Есенин С.А.', Decimal('650.00'), Decimal('650.00'), Decimal('650.0000000000000000')),
 ('Булгаков М.А.', Decimal('540.50'), Decimal('670.99'), Decimal('605.7450000000000000')),
 ('Достоевский Ф.М.', Decimal('460.00'), Decimal('799.01'), Decimal('579.8366666666666667')),
 ('Пушкин А.С.', Decimal('520.50'), Decimal('520.50'), Decimal('520.5000000000000000')),
 ('Гумилев Н.С.', Decimal('460.00'), Decimal('460.00'), Decimal('460.0000000000000000')),
 ('Иванов С.С.', Decimal('50.00'), Decimal('50.00'), Decimal('50.0000000000000000'))]

In [37]:
%%sql
SELECT author,
    SUM(price * amount) AS Стоимость,
    ROUND((SUM(price * amount) * 18.0 / 100) / (1 + 18.0 / 100), 2) AS НДС,
    ROUND(SUM(price * amount) / (1 + 18.0 / 100), 2) AS Стоимость_без_НДС
FROM stepik.book
GROUP BY author;

 * postgresql://postgres:***@localhost:5432/postgres
8 rows affected.

[('Рушди Салман', Decimal('4750.00'), Decimal('724.58'), Decimal('4025.42')),
 ('Бехтерев С.С.', Decimal('4600.00'), Decimal('701.69'), Decimal('3898.31')),
 ('Есенин С.А.', Decimal('9750.00'), Decimal('1487.29'), Decimal('8262.71')),
 ('Булгаков М.А.', Decimal('4715.47'), Decimal('719.31'), Decimal('3996.16')),
 ('Достоевский Ф.М.', Decimal('11003.02'), Decimal('1678.43'), Decimal('9324.59')),
 ('Пушкин А.С.', Decimal('3643.50'), Decimal('555.79'), Decimal('3087.71')),
 ('Гумилев Н.С.', Decimal('4600.00'), Decimal('701.69'), Decimal('3898.31')),
 ('Иванов С.С.', Decimal('500.00'), Decimal('76.27'), Decimal('423.73'))]

In [39]:
%%sql
SELECT 
    MIN(price) AS Минимальная_цена,
    MAX(price) AS Максимальная_цена,
    ROUND(AVG(price), 2) AS Средняя_цена
FROM stepik.book;

 * postgresql://postgres:***@localhost:5432/postgres
1 rows affected.

[(Decimal('50.00'), Decimal('950.00'), Decimal('549.23'))]

In [45]:
%%sql
SELECT 
    ROUND(AVG(price), 2) AS Средняя_цена,
    ROUND(SUM(price * amount), 2) AS Стоимость
FROM stepik.book
WHERE amount BETWEEN 5 AND 14;

 * postgresql://postgres:***@localhost:5432/postgres
1 rows affected.

[(Decimal('490.19'), Decimal('30201.00'))]

In [52]:
%%sql
SELECT author, SUM(price * amount) AS Стоимость
FROM stepik.book
WHERE title NOT IN ('Идиот', 'Белая гвардия')
GROUP BY author
HAVING SUM(price * amount) > 5000
ORDER BY Стоимость DESC;

 * postgresql://postgres:***@localhost:5432/postgres
2 rows affected.

[('Есенин С.А.', Decimal('9750.00')), ('Достоевский Ф.М.', Decimal('6403.02'))]

In [56]:
%%sql
SELECT author,
    COUNT(title) AS Количесвто_произведений,
    MIN (price) AS Минимальная_цена,
    SUM(amount) AS Число_книг
FROM stepik.book
WHERE price > 500 AND amount > 1
GROUP BY author
HAVING COUNT(title) >= 2;

 * postgresql://postgres:***@localhost:5432/postgres
1 rows affected.

[('Булгаков М.А.', 2, Decimal('540.50'), 8)]

NameError: name 'git' is not defined